Autodesk.Revit.DB.BackgroundProcessTask.BackgroundProcessTaskStatus
Specifies the state in which the task finished.
The values are passed to the callback, which will
then handle any necessary post processing

Autodesk.Revit.DB.BackgroundProcessTask.BackgroundProcessTaskStatus.Aborted
User interrupted the task before finishing

Autodesk.Revit.DB.BackgroundProcessTask.BackgroundProcessTaskStatus.Failure
The task was able to finish running, but did not complete the task

Autodesk.Revit.DB.BackgroundProcessTask.BackgroundProcessTaskStatus.Success
Task finished as expected

Autodesk.Revit.DB.BackgroundProcessTask.BackgroundProcessTaskStatus.None
Similar to returning void, use if the callback handles every possible status already